Ran Plan for dir: `envs/poc/levis/ap-northeast-1/vpc/test-auto-create-vpc` workspace: `default`

**Plan Error**
<details><summary>Show Output</summary>

```
running "/usr/bin/terraform plan -input=false -refresh -out \"/root/.atlantis/repos/linux-yangli/tf-test/12/default/envs/poc/levis/ap-northeast-1/vpc/test-auto-create-vpc/default.tfplan\"" in "/root/.atlantis/repos/linux-yangli/tf-test/12/default/envs/poc/levis/ap-northeast-1/vpc/test-auto-create-vpc": exit status 1
module.vpc.data.aws_availability_zones.available: Reading...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # module.vpc.module.vpc.aws_default_network_acl.this[0] will be created
  + resource "aws_default_network_acl" "this" {
      + arn                    = (known after apply)
      + default_network_acl_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + tags                   = {
          + "Name"      = "test-auto-create-vpc-default"
          + "create_by" = "terraform"
          + "desc"      = "vpc for eks cluster."
          + "vpc_name"  = "test-auto-create-vpc"
        }
      + tags_all               = {
          + "Name"      = "test-auto-create-vpc-default"
          + "create_by" = "terraform"
          + "desc"      = "vpc for eks cluster."
          + "vpc_name"  = "test-auto-create-vpc"
        }
      + vpc_id                 = (known after apply)

      + egress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
        }
      + egress {
          + action     = "allow"
          + cidr_block = "0.0.0.0/0"
          + from_port  = 0
          + protocol   = "-1"
          + rule_no    = 100
          + to_port    = 0
        }

      + ingress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
        }
      + ingress {
          + action     = "allow"
          + cidr_block = "0.0.0.0/0"
          + from_port  = 0
          + protocol   = "-1"
          + rule_no    = 100
          + to_port    = 0
        }
    }

  # module.vpc.module.vpc.aws_default_route_table.default[0] will be created
  + resource "aws_default_route_table" "default" {
      + arn                    = (known after apply)
      + default_route_table_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + route                  = (known after apply)
      + tags                   = {
          + "Name"      = "test-auto-create-vpc-default"
          + "create_by" = "terraform"
          + "desc"      = "vpc for eks cluster."
          + "vpc_name"  = "test-auto-create-vpc"
        }
      + tags_all               = {
          + "Name"      = "test-auto-create-vpc-default"
          + "create_by" = "terraform"
          + "desc"      = "vpc for eks cluster."
          + "vpc_name"  = "test-auto-create-vpc"
        }
      + vpc_id                 = (known after apply)

      + timeouts {
          + create = "5m"
          + update = "5m"
        }
    }

  # module.vpc.module.vpc.aws_default_security_group.this[0] will be created
  + resource "aws_default_security_group" "this" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"      = "test-auto-create-vpc-default"
          + "create_by" = "terraform"
          + "desc"      = "vpc for eks cluster."
          + "vpc_name"  = "test-auto-create-vpc"
        }
      + tags_all               = {
          + "Name"      = "test-auto-create-vpc-default"
          + "create_by" = "terraform"
          + "desc"      = "vpc for eks cluster."
          + "vpc_name"  = "test-auto-create-vpc"
        }
      + vpc_id                 = (known after apply)
    }

  # module.vpc.module.vpc.aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.10.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name"      = "test-auto-create-vpc"
          + "create_by" = "terraform"
          + "desc"      = "vpc for eks cluster."
          + "vpc_name"  = "test-auto-create-vpc"
        }
      + tags_all                             = {
          + "Name"      = "test-auto-create-vpc"
          + "create_by" = "terraform"
          + "desc"      = "vpc for eks cluster."
          + "vpc_name"  = "test-auto-create-vpc"
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.
╷
│ Warning: Argument is deprecated
│ 
│   with module.vpc.module.vpc.aws_eip.nat,
│   on .terraform/modules/vpc.vpc/main.tf line 1044, in resource "aws_eip" "nat":
│ 1044:   vpc = true
│ 
│ use domain attribute instead
╵
╷
│ Error: fetching Availability Zones: UnauthorizedOperation: You are not authorized to perform this operation. User: arn:aws:sts::136703429527:assumed-role/AWSReservedSSO_aws-devtest-sre-pom-rw01_8022a7a443946ff2/levis.yang@bitget.com is not authorized to perform: ec2:DescribeAvailabilityZones with an explicit deny in an identity-based policy
│ 	status code: 403, request id: 331a3b96-7d13-466b-99d3-e0538058521d
│ 
│   with module.vpc.data.aws_availability_zones.available,
│   on ../../../../../../modules/vpc_eks/main.tf line 2, in data "aws_availability_zones" "available":
│    2: data "aws_availability_zones" "available" {}
│ 
╵

```
</details>